SCHEMES = {

    # Poor family LPG connection
    "प्रधानमंत्री उज्ज्वला योजना": 
        "गरीब परिवारों को मुफ्त/सब्सिडी वाले गैस कनेक्शन का लाभ प्रदान करती है।",

    # Old age pension
    "राष्ट्रीय वृद्धावस्था पेंशन योजना":
        "60 वर्ष से अधिक आयु के नागरिकों को मासिक पेंशन प्रदान करती है।",

    # SC / ST entrepreneurship support
    "दलित उद्यमिता विकास योजना":
        "SC/ST युवाओं को व्यवसाय शुरू करने के लिए वित्तीय सहायता और प्रशिक्षण देती है।",

    # OBC scholarship
    "ओबीसी छात्रवृत्ति योजना":
        "OBC वर्ग के छात्रों को उच्च शिक्षा हेतु छात्रवृत्ति प्रदान करती है।",

    # Skill development (PMKVY)
    "प्रधानमंत्री कौशल विकास योजना":
        "18–45 वर्ष के युवाओं को कौशल प्रशिक्षण और रोजगार के अवसर प्रदान करती है।",

    # Mudra Loan scheme
    "मुद्रा लोन योजना":
        "छोटे व्यवसाय और स्टार्टअप शुरू करने के लिए बिना गारंटी का लोन प्रदान करती है।"
}

def search_scheme(name):
    return SCHEMES.get(name, "योजना की जानकारी उपलब्ध नहीं")
